from scipy.optimize import linprog

if __name__ == '__main__':

    s1 = 100
    s2 = 200
    h1_1 = 20
    h1_2 = 15
    
    h2_1 = 35
    h2_2 = 30
    
    c1 = 6
    c2 = 4
    
    c11 = h1_1*c1
    c12 = h1_2*c1
    c21 = h2_1*c2
    c22 = h2_2*c2
    
    
    c = [-c11,-c12,-c21,-c22]
    # в A_ub и b_ub задаются неравенства 
    # в виде коэффициентов для каждого в строках A_ub 
    # и соответствующих им ограничивающих значений в строках b_ub
    A_ub = [[-h1_1,-h1_2,0,0],
                [0,0,-h2_1,-h2_2],
                [1,0,1,0], [0,1,0,1]] 
    b_ub = [-1500,-4500,100,200]
    
    print(linprog(c, A_ub, b_ub))
    
    
    
    # # коэффициенты выручки для каждой культуры
    # prs_coef = [90,100,200]
    # # коэффициенты трудовых затрат 
    # hum_res_coefs = [100,80,120]
    # # ограничение на трудовые затраты
    # hum_res_lim = 2000
    # # коэффициенты материальных затрат
    # mat_res_coefs = [50,30,60]
    # # ограничение на материальные затраты
    # mat_res_lim = 3000
    # # коэффициенты при объемах культур и ограничение на объем земель
    # vols_coefs = [1,1,1]
    # vol_lim = 100

    # #  linprog минимизирует целевую функцию, 
    # # поэтому для ее максимизации 
    # #  нужно умножить на (-1)
    # c = [it*(-1) for it in prs_coef]
    # # в A_ub и b_ub задаются неравенства 
    # # в виде коэффициентов для каждого в строках A_ub 
    # # и соответствующих им ограничивающих значений в строках b_ub
    # A_ub = [hum_res_coefs,
    #             mat_res_coefs,
    #             vols_coefs] 
    # b_ub = [hum_res_lim,mat_res_lim,vol_lim]
    
    # print(linprog(c, A_ub, b_ub))
    
    
    
    
    
    # # тестовый пример
    # # proceeds - выручка, 
    # prs_coef = [80,50,65]
    
    # # трудовые затраты 2520
    # hum_res_coefs = [80,100,120]
    # hum_res_lim = 2520
    # # материальн затраты 1200
    # mat_res_coefs = [60,40,50]
    # mat_res_lim = 1200
    # # ограничение на объем пашни
    # vols_coefs = [1,1,1]
    # vol_lim = 22
    
    
    
    
    # print(linprog(c, A_ub, b_ub, A_eq, b_eq))
    
    
    # c = [7, 3, 6,4,8,2,1,5,9]
    
    # A_ub = [[1,1,1,0,0,0,0,0,0],
    #            [0,0,0,1,1,1,0,0,0],
    #            [0,0,0,0,0,0,1,1,1]] 
    # b_ub = [74,40,36]
    
    
    # A_eq = [[1,0,0,1,0,0,1,0,0],
    #            [0,1,0,0,1,0,0,1,0],
    #            [0,0,1,0,0,1,0,0,1]] 
    # b_eq = [20,45,30] 
    # print(linprog(c, A_ub, b_ub, A_eq, b_eq))